Revit 2027 API
SunAndShadowSettings.FitToModel Method
 Adjust SunAndShadowSettings to fit around the current model geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void FitToModel()
Public Sub FitToModel
public:
void FitToModel()
member FitToModel : unit -> unit
Exceptions
Exception | Condition
ArgumentException |  The SunAndShadowSettings is not view-specific.
See Also
Reference
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace